W6D5/Kats99/app/models/cat_rental_request.rb

SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" IS NOT NULL AND "cat_rental_requests"."cat_id" = ? AND NOT (start_date > '2021-02-17' OR end_date < '2021-02-09') AND (status = 'APPROVED') LIMIT ?  [["cat_id", 1], ["LIMIT", 1]]
---
  def does_not_overlap_approved_request
    return if self.denied?

    unless overlapping_approved_requests.empty?