W8D1/Reddit_Clone/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def show
    @post = Post.find_by(id: params[:id])