W8D1/Reddit_Clone/app/controllers/subs_controller.rb

  def update
    @sub = Sub.find_by(id: params[:id])
    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "two wheels and an engine, sometimes more, sometimes less."], ["updated_at", "2021-03-08 23:01:56.843123"], ["id", 1]]