W6D5/Kats99/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ? ORDER BY start_date  [["cat_id", 1]]
---
  </tr>
  <% @cat.rental_requests.order('start_date').each do |req| %>