W6D5/Kats99/app/controllers/cat_rental_requests_controller.rb

  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)

    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cat_id", 1], ["start_date", "2021-02-09"], ["end_date", "2021-02-17"], ["status", "PENDING"], ["created_at", "2021-02-28 23:48:21.853500"], ["updated_at", "2021-02-28 23:48:21.853500"]]