W6D5/Kats99/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = ?, "name" = ?, "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["birth_date", "2021-02-23"], ["name", "Edited Cat"], ["description", "New year new me"], ["updated_at", "2021-02-28 05:41:38.888376"], ["id", 8]]